Revit 2027 API
DirectShapeFailures Properties
The BuiltInFailures.DirectShapeFailures type exposes the following members.
Properties
Name | Description
CannotCreateDirectShapeOrTypeDocumentCorruption |  Cannot create a DirectShape or DirectShapeType.
CannotCreateDirectShapeOrTypeError |  Cannot create a DirectShape or DirectShapeType.
CannotCreateDirectShapeOrTypeWarning |  Cannot create a DirectShape or DirectShapeType.
CannotCreateDirectShapeRefsWarning |  Cannot create reference objects for a DirectShape.
CannotCreateDirectShapeTypeRefsWarning |  Cannot create reference objects for a DirectShapeType.
Top
See Also
Reference
BuiltInFailures.DirectShapeFailures Class
Autodesk.Revit.DB Namespace